<template>
  <v-navigation-drawer permanent theme="dark" width="200">
    <v-list nav>
      <v-list-item
        v-for="(item, i) in yearList"
        :key="item"
        :title="`20${item.year}`"
        :value="i"
        @click="select(item, $event)"
      ></v-list-item>
    </v-list>
  </v-navigation-drawer>
</template>
<script>
export default {
  methods: {
    select(item) {
      console.log(item);
      this.$router.push({ name: "DashBoard", query: item });
    },
    moveHome() {
      this.$router.push("/");
    },
  },
  data() {
    return {
      yearList: [
        {
          year: "17",
          homerun: [
            [17, "로사리오(!등)", 37],
            [17, "김재환(2등)", 35],
            [17, "스크럭스(2등)", 35],
          ],
          Hit: [
            [17, "손아섭(1등)", 193],
            [17, "김재환(2등)", 185],
            [17, "이정후(3등", 179],
          ],
          scorer: [
            [17, "러프(1등)", 124],
            [17, "최형우(2등)", 120],
            [17, "김재환(3등)", 115],
          ],
          "strike out": [
            [17, "구자욱", 138],
            [17, "스크럭스", 134],
            [17, "김재환*", 123],
          ],
          "four ball": [
            [17, "최형우", 96],
            [17, "손아섭", 83],
            [17, "김재환*", 81],
          ],
          stolenbase: [
            [17, "박해민", 40],
            [17, "버나디나", 32],
            [17, "손아섭", 25],
          ],
          teams: [
            "LG",
            "한화",
            "넥센",
            "삼성",
            "롯데",
            "KIA",
            "NC",
            "kt",
            "두산",
            "SK",
          ],
          team_hits: [10, 10, 10, 10, 10, 11, 10, 10, 11, 8],
        },
        {
          year: "18",
          homerun: [
            [18, "최정(1등)", 46],
            [18, "김재환(2등)", 44],
            [18, "로하스(3등)", 43],
          ],
          Hit: [
            [18, "전준우(1등)", 190],
            [18, "손아섭(2등)", 182],
            [18, "이대호(3등)", 181],
          ],
          scorer: [
            [18, "김재환(1등)", 133],
            [18, "러프(2등)", 125],
            [18, "이대호(2등)", 125],
          ],
          "strike out": [
            [18, "오지환", 146],
            [18, "스크럭스", 144],
            [18, "이성열", 143],
          ],
          "four ball": [
            [18, "로맥", 72],
            [18, "로하스", 71],
            [18, "최정", 70],
          ],
          stolenbase: [
            [18, "박해민", 36],
            [18, "버나디나", 32],
            [18, "이용규", 30],
          ],
          teams: [
            "LG",
            "한화",
            "Hero",
            "삼성",
            "롯데",
            "KIA",
            "KT",
            "NC",
            "두산",
            "SK",
          ],
          team_hits: [10, 9, 10, 10, 10, 10, 9, 9, 11, 11],
        },
        {
          year: "19",
          homerun: [
            [19, "박병호(1등)", 33],
            [19, "최정(2등)", 29],
            [19, "로맥(2등)", 29],
          ],
          Hit: [
            [19, "페르난데스(1등)", 197],
            [19, "이정후(2등)", 193],
            [19, "이천웅(3등)", 168],
          ],
          scorer: [
            [19, "샌즈(1등)", 113],
            [19, "김하성(2등)", 104],
            [19, "로하스(2등)", 104],
          ],
          "strike out": [
            [19, "로하스(1등)", 120],
            [19, "박병호(2등)", 117],
            [19, "로맥(2등)", 117],
          ],
          "four ball": [
            [19, "최형우", 85],
            [19, "러프", 80],
            [19, "박병호", 78],
          ],
          stolenbase: [
            [19, "박찬호", 39],
            [19, "김하성", 33],
            [19, "고종욱", 31],
          ],
          teams: [
            "LG",
            "한화",
            "Hero",
            "삼성",
            "KIA",
            "롯데",
            "KT",
            "NC",
            "두산",
            "SK",
          ],
          team_hits: [10, 10, 11, 9, 10, 9, 10, 11, 10, 10],
        },
        {
          year: "20",
          homerun: [
            [20, "로하스(1등)", 47],
            [20, "라모스(2등)", 38],
            [20, "나성범(3등)", 34],
          ],
          Hit: [
            [20, "페르난데스(1등)", 199],
            [20, "로하스(2등)", 192],
            [20, "손아섭(3등)", 190],
          ],
          scorer: [
            [20, "로하스(1등)", 135],
            [20, "양의지(2등)", 124],
            [20, "김현수(3등)", 119],
          ],
          "strike out": [
            [20, "김재환*", 154],
            [20, "알테어", 149],
            [20, "나성범", 148],
          ],
          "four ball": [
            [20, "로맥", 91],
            [20, "서건창", 91],
            [20, "김재환*", 91],
          ],
          stolenbase: [
            [20, "심우준", 35],
            [20, "박해민", 34],
            [20, "김혜성", 25],
          ],
          teams: [
            "LG",
            "한화",
            "Hero",
            "삼성",
            "KIA",
            "롯데",
            "KT",
            "NC",
            "두산",
            "SK",
          ],
          team_hits: [10, 9, 10, 10, 10, 10, 11, 11, 11, 9],
        },
        {
          year: "21",
          homerun: [
            [21, "최정(1등)", 35],
            [21, "나성범(2등)", 33],
            [21, "알테어(3등)", 32],
          ],
          Hit: [
            [21, "전준우(1등)", 192],
            [21, "강백호(2등)", 179],
            [21, "최원준(3등)", 174],
          ],
          scorer: [
            [21, "양의지(1등)", 111],
            [21, "강백호(2등)", 102],
            [21, "김재환(2등)", 102],
          ],
          "strike out": [
            [21, "알테어", 156],
            [21, "나성범", 155],
            [21, "박병호", 141],
          ],
          "four ball": [
            [21, "홍창기", 109],
            [21, "정은원", 105],
            [21, "강백호", 104],
          ],
          stolenbase: [
            [21, "김혜성", 46],
            [21, "최원준", 40],
            [21, "박해민", 36],
          ],
          teams: [
            "LG",
            "SSG",
            "한화",
            "Hero",
            "삼성",
            "롯데",
            "KIA",
            "KT",
            "NC",
            "두산",
          ],
          team_hits: [9, 10, 9, 10, 10, 11, 10, 10, 10, 10],
        },
        {
          year: "22",
          homerun: [
            [22, "박병호(1등)", 35],
            [22, "피렐라(2등)", 28],
            [22, "최정(3등)", 26],
          ],
          Hit: [
            [22, "이정후(1등)", 193],
            [22, "피렐라(2등)", 192],
            [22, "나성범(3등)", 180],
          ],
          scorer: [
            [22, "이정후(1등)", 113],
            [22, "피렐라(2등)", 109],
            [22, "김현수(3등)", 106],
          ],
          "strike out": [
            [22, "나성범", 137],
            [22, "한유섬", 137],
            [22, "오재일", 133],
          ],
          "four ball": [
            [22, "정은원", 85],
            [22, "최형우", 73],
            [22, "추신수", 71],
          ],
          stolenbase: [
            [22, "박찬호", 42],
            [22, "김혜성", 34],
            [22, "최지훈", 31],
          ],
          teams: [
            "LG",
            "SSG",
            "한화",
            "Hero",
            "삼성",
            "롯데",
            "KIA",
            "KT",
            "NC",
            "두산",
          ],
          team_hits: [10, 10, 9, 10, 11, 10, 11, 10, 10, 10],
        },
        {
          year: "23",
          homerun: [
            [23, "양석환(1등)", 6],
            [23, "채은성(공동2등)", 5],
            [23, "피렐라(공동2등)", 5],
          ],
          Hit: [
            [23, "에레디아(1등)", 40],
            [23, "문성주(2등)", 38],
            [23, "김혜성(2등)", 37],
          ],
          scorer: [
            [23, "러셀(1등)", 27],
            [23, "채은성(2등)", 24],
            [23, "에레디아(2등)", 24],
          ],
          "strike out": [
            [23, "오재일", 35],
            [23, "김주원", 34],
            [23, "오그레디", 31],
          ],
          "four ball": [
            [23, "문보경", 20],
            [23, "홍창기", 20],
            [23, "박성한", 20],
          ],
          stolenbase: [
            [23, "김혜성", 10],
            [23, "이원석", 7],
            [23, "박민우", 7],
          ],
          teams: [
            "LG",
            "한화",
            "SSG",
            "Hero",
            "삼성",
            "KIA",
            "롯데",
            "KT",
            "NC",
            "두산",
          ],
          team_hits: [12, 9, 10, 10, 10, 9, 9, 11, 10, 9],
        },
      ],
    };
  },
};
</script>

<style>
.v-list-item--nav .v-list-item-title {
  font-size: 3.8125rem;
}
</style>
